tap "homebrew/bundle"
tap "homebrew/services"
tap "pirj/noclamshell"
tap "sidneys/homebrew"
tap "stripe/stripe-cli"
brew "act"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "aria2"
brew "bat"
brew "cabextract"
brew "glib"
brew "python@3.12"
brew "ccache"
brew "cdrtools"
brew "clang-format"
brew "cmake"
brew "cmake-docs"
brew "coreutils"
brew "croc"
brew "dfu-util"
brew "direnv"
brew "doc8", link: false
brew "docker"
brew "docutils"
brew "doxygen"
brew "duti"
brew "harfbuzz"
brew "openjpeg"
brew "pango"
brew "fzf"
brew "libavif"
brew "gdk-pixbuf"
brew "ghostscript"
brew "git"
brew "gnu-sed"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "lefthook"
brew "llvm"
brew "minicom"
brew "neovim"
brew "ninja"
brew "node"
brew "openjdk"
brew "pandoc"
brew "pipx"
brew "protobuf"
brew "python-tk@3.12"
brew "python@3.11"
brew "repo"
brew "scrcpy"
brew "spaceman-diff"
brew "spark"
brew "tmux"
brew "west"
brew "wget"
brew "wimlib"
brew "yt-dlp"
brew "pirj/noclamshell/noclamshell"
brew "stripe/stripe-cli/stripe"
cask "airtable", args: { appdir: "/Applications" }
cask "anaconda"
cask "android-platform-tools"
cask "arq", args: { appdir: "/Applications" }
cask "handbrake", args: { appdir: "/Applications" }
cask "keycastr"
cask "mactex"
cask "monitorcontrol"
cask "multipass"
cask "notion-calendar", args: { appdir: "/Applications" }
cask "qt-creator"
cask "raycast", args: { appdir: "/Applications" }
cask "temurin"
cask "vlc", args: { appdir: "/Applications" }
cask "warp", args: { appdir: "/Applications" }
cask "zed", args: { appdir: "/Applications" }
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "adpyke.vscode-sql-formatter"
vscode "affenwiesel.matlab-formatter"
vscode "ajshort.include-autocomplete"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "analytic-signal.preview-html"
vscode "apommel.matlab-interactive-terminal"
vscode "atlassian.atlascode"
vscode "austin.code-gnu-global"
vscode "ban.spellright"
vscode "bat67.matlab-extension-pack"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "boto3typed.boto3-ide"
vscode "bramvanbilsen.matlab-code-run"
vscode "chakrounanas.turbo-console-log"
vscode "cheshirekow.cmake-format"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "codium.codium"
vscode "cschlosser.doxdocgen"
vscode "dan-c-underwood.arm"
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "danielsanmedium.dscodegpt"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "espressif.esp-idf-extension"
vscode "felipecaputo.git-project-manager"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.docker-explorer"
vscode "formulahendry.iot-extension-pack"
vscode "formulahendry.platformio"
vscode "formulahendry.vscode-node-red"
vscode "fougas.msys2"
vscode "foxundermoon.shell-format"
vscode "franneck94.c-cpp-runner"
vscode "funkyremi.vscode-google-translate"
vscode "fwcd.kotlin"
vscode "geeklearningio.graphviz-markdown-preview"
vscode "genieai.chatgpt-vscode"
vscode "gera2ld.markmap-vscode"
vscode "gimly81.matlab"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hars.cppsnippets"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "henriiik.docker-linter"
vscode "hoovercj.vscode-power-mode"
vscode "huizhou.githd"
vscode "ibm.output-colorizer"
vscode "immament.vscode-ngrx-uml"
vscode "ionutvmi.path-autocomplete"
vscode "irongeek.vscode-env"
vscode "janisdd.vscode-edit-csv"
vscode "jbenden.c-cpp-flylint"
vscode "jebbs.plantuml"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jock.svg"
vscode "johnpapa.vscode-peacock"
vscode "josetr.cmake-language-support-vscode"
vscode "kamikillerto.vscode-colorize"
vscode "keroc.hex-fmt"
vscode "kevinrose.vsc-python-indent"
vscode "khanghua.sqltools-dynamodb-driver"
vscode "kumar-harsh.graphql-for-vscode"
vscode "leojhonsong.ccpp-extension-pack"
vscode "lextudio.restructuredtext"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mark-tucker.aws-cli-configure"
vscode "marus25.cortex-debug"
vscode "matepek.vscode-catch2-test-adapter"
vscode "maxim.vscode-ariatemplates-highlighter"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.peripheral-viewer"
vscode "mcu-debug.rtos-views"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "mgesbert.python-path"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "mitaki28.vscode-clang"
vscode "mohsen1.prettify-json"
vscode "moyu.snapcode"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-ai"
vscode "ms-toolsai.vscode-ai-remote"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-embedded-tools"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "myxvisual.vscode-ts-uml"
vscode "naumovs.color-highlight"
vscode "njqdev.vscode-python-typehint"
vscode "nordic-semiconductor.nrf-connect"
vscode "nordic-semiconductor.nrf-connect-extension-pack"
vscode "nordic-semiconductor.nrf-devicetree"
vscode "nordic-semiconductor.nrf-kconfig"
vscode "nordic-semiconductor.nrf-terminal"
vscode "nxpsemiconductors.mcuxpresso"
vscode "oderwat.indent-rainbow"
vscode "platformio.platformio-ide"
vscode "plex.vscode-protolint"
vscode "pnp.polacode"
vscode "quicktype.quicktype"
vscode "randomfractalsinc.vscode-data-preview"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "robocorp.robotframework-lsp"
vscode "searking.preview-vscode"
vscode "shan.code-settings-sync"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "skyran.matlab-snippets"
vscode "slaier.matlab-complete"
vscode "starkwang.markdown"
vscode "steoates.autoimport"
vscode "stmicroelectronics.stm32-vscode-extension"
vscode "streetsidesoftware.code-spell-checker"
vscode "tabnine.tabnine-vscode"
vscode "takumii.markdowntable"
vscode "theumletteam.umlet"
vscode "tht13.python"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tomoki1207.pdf"
vscode "trond-snekvik.devicetree"
vscode "trond-snekvik.gnu-mapfiles"
vscode "trond-snekvik.kconfig-lang"
vscode "trond-snekvik.simple-rst"
vscode "tushortz.python-extended-snippets"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-manifest-yaml"
vscode "vsciot-vscode.azure-iot-edge"
vscode "vsciot-vscode.azure-iot-toolkit"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "well-ar.plantuml"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
vscode "xaver.clang-format"
vscode "yog.yog-plantuml-highlight"
vscode "yy0931.save-as-root"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zhuangtongfa.material-theme"
vscode "zixuanwang.linkerscript"
vscode "ziyasal.vscode-open-in-github"
vscode "zxh404.vscode-proto3"
